<template>
    <transition name="slide">
        <div class="terms-container">
            <div style="position: fixed;width: 100%; z-index: 90;">
                <Back :destRoute="'/me'" :title="'测试平台使用协议'"/>
            </div>
            <div class="terms">
                <div class="terms-title">爱测试平台使用协议</div>
                <div class="terms-section">一. 总则</div>
                <p>
                    1 爱测试（企业端）及爱测试（个人端）的所有权和运营权归黄云峰及刘昆仑共同所有。
                </p>
                <p>
                    1.2 用户在使用本平台的服务之前，应当仔细阅读本协议，并同意遵守本协议及所有平台规则。一旦用户开始使用本平台服务，不管是否注册成功，用户即与本平台之间自动形成协议关系，用户应当受本协议及所有平台规则的约束。如果您不同意本平台协议及规则，您可以主动停用爱测试提供的服务；您一旦使用爱测试提供的服务，即视为您已了解并完全同意本平台使用协议的各项类容。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。
                </p>
                <p>
                    1.3 本协议、平台规则可由本平台随时更新，用户在使用爱测试产品时应当及时关注，用户同意本平台不承担通知义务。本平台的通知、公告、声明或其它类似内容是本协议及平台规则的一部分。
                </p>
                <div class="terms-section">二、服务内容</div>
                <p>
                    2.1 本网络服务的具体内容由本平台根据实际情况提供，例如论坛、博客、相册、部落、分类信息等。
                </p>
                <p>
                    2.2 本测试平台测试版提供的部分网络服务为免费的网络服务，在一定试用期内本平台不会收取用户任何费用。在一定试用期后，本社区会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才会被收取服务费用。如用户拒绝支付相关费用，则本平台有权不向用户提供付费网络服务。
                </p>
                <p>
                    2.3 本平台仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。
                </p>
                <div class="terms-section">三、用户帐号</div>
                <p>
                    3.1 用户可通过以下方式注册成为爱测试的正式用户：
                </p>
                <p>
                    (1)经本平台会员系统完成注册程序并通过身份认证的用户；
                </p>
                <p>
                    (2)经平台批准的第三方合作网站登录的的用户；
                </p>
                <p>
                    成为爱测试正式用户即获得本平台规定用户所应享有的一切权限；未经认证仅享有本平台规定的部分会员权限。爱测试有权对会员的权限设计进行变更。
                </p>
                <p>
                    3.2 用户帐号注册
                </p>
                <p>
                    (1)使用本平台会员系统注册的用户，只能使用汉字、英文字母、数字、下划线及它们的组合，禁止使用空格、各种符号和特殊字符，且最多不超过16个字符(8个汉字)注册，否则将不予注册。
                </p>
                <p>
                    (2)使用第三方合作网站登录的用户，只能使用汉字、英文字母、数字、下划线及它们的组合，禁止使用空格、各种符号和特殊字符，且最多不超过14个字符(7个汉字)注册，否则本平台有权只截取前14个字符（7个汉字）予以显示用户帐号（若该用户帐号与社区现有用户帐号重名，系统将随机添加一个字符以示区别），否则将不予注册。
                </p>
                <p>
                    3.3 如发现用户帐号中含有不雅文字或不恰当名称的，本平台保留取消其用户资格的权利，相应后果由用户自行承担。
                </p>
                <p>
                    (1)请勿以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；
                </p>
                <p>
                    (2)请勿以国家机构或其他机构的名称注册；
                </p>
                <p>
                    (3)请勿注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的帐号；
                </p>
                <p>
                    (4)请勿注册易产生歧义、引起他人误解或其它不符合法律规定的帐号。
                </p>
                <p>
                    3.4 如发现用户的头像、简介/心情等个人信息中包含违法和不良信息的，本平台保留取消其用户资格的权利。
                </p>
                <p>
                    3.5 用户帐号（爱测试ID）的所有权归本平台，用户仅享有使用权。未经爱测试许可，任何人不得赠与、借用、租用、转让或售卖爱测试账号，或者以其他方式许可非初始申请注册人使用爱测试账号。3个月未使用的用户帐号，本社区保留收回的权利。
                </p>
                <p>
                    3.6 用户有义务保证密码和帐号的安全，用户利用该密码和帐号所进行的一切活动引起的任何损失或损害，由用户自行承担全部责任，本平台不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请通知本平台。因黑客行为或用户的保管疏忽导致帐号非法使用，本平台不承担任何责任。
                </p>
                <p>
                    3.7 用户应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。如果因注册信息不真实或更新不及时而引发的相关问题，爱测试不负任何责任。
                </p>
                <div class="terms-section">四、使用规则</div>
                <p>
                    4.1 遵守中华人民共和国相关法律法规，包括但不限于《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《最高人民法院关于审理涉及计算机网络著作权纠纷案件适用法律若干问题的解释(法释[2004]1号)》、《全国人大常委会关于维护互联网安全的决定》、《互联网电子公告服务管理规定》、《互联网新闻信息服务管理规定》、《互联网著作权行政保护办法》、《信息网络传播权保护条例》和《互联网用户账号名称管理规定》等有关计算机互联网规定和知识产权的法律和法规、实施办法。
                </p>
                <p>
                    4.2 用户对其自行发表、上传或传送的内容负全部责任，所有用户不得在本平台任何页面发布、转载、传送含有下列内容之一的信息，否则本平台有权自行处理并不通知用户：
                </p>
                <p>
                    (1)违反宪法确定的基本原则的；
                </p>
                <p>
                    (2)危害国家安全，泄漏国家机密，颠覆国家政权，破坏国家统一的；
                </p>
                <p>
                    (3)损害国家荣誉和利益的；
                </p>
                <p>
                    (4)煽动民族仇恨、民族歧视，破坏民族团结的；
                </p>
                <p>
                    (5)破坏国家宗教政策，宣扬邪教和封建迷信的；
                </p>
                <p>
                    (6)散布谣言，扰乱社会秩序，破坏社会稳定的；
                </p>
                <p>
                    (7)散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
                </p>
                <p>
                    (8)侮辱或者诽谤他人，侵害他人合法权益的；
                </p>
                <p>
                    (9)煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；
                </p>
                <p>
                    (10)以非法民间组织名义活动的；
                </p>
                <p>
                    (11)含有法律、法规、规章、地方规范性文件、国家政策、政府通知、公序良俗等禁止的内容；
                </p>
                <p>
                    (12)本平台认为不利于平台生态、可能给平台造成损失的内容。
                </p>
                <p>
                    4.3 用户承诺对其发表或者上传于本平台的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；如用户违反本条规定造成本平台被第三人索赔的，用户应全额补偿本平台一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)；
                </p>
                <p>
                    4.4 当第三方认为用户发表或者上传于本平台的信息侵犯其权利，并根据《信息网络传播权保护条例》或者相关法律规定向本社区发送权利通知书时，用户同意本平台可以自行判断决定删除涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性，本社区将不会自动恢复上述删除的信息；
                </p>
                <p>
                    (1)不得为任何非法目的而使用网络服务系统；
                </p>
                <p>
                    (2)遵守所有与网络服务有关的网络协议、规定和程序；
                </p>
                <p>
                    (3)不得利用本平台服务进行任何可能对互联网的正常运转造成不利影响的行为；
                </p>
                <p>
                    (4)不得利用本平台服务进行任何不利于本社区的行为。
                </p>
                <p>
                    4.5 如用户在使用网络服务时违反上述任何规定，本平台有权要求用户改正或直接采取一切必要的措施(包括但不限于删除用户张贴的内容、暂停或终止用户使用网络服务的权利)以减轻用户不当行为而造成的影响。
                </p>
                <div class="terms-section">五、隐私保护</div>
                <p>
                    5.1 本平台不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在本平台的非公开内容，但下列情况除外：
                </p>
                <p>
                    (1)事先获得用户的明确授权；
                </p>
                <p>
                    (2)根据有关的法律法规要求；
                </p>
                <p>
                    (3)按照相关政府主管部门的要求；
                </p>
                <p>
                    (4)为维护社会公众的利益。
                </p>
                <p>
                    5.2 本平台可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本平台同等的保护用户隐私的责任，则本平台有权将用户的注册资料等提供给该第三方。
                </p>
                <p>
                    5.2 在不透露单个用户隐私资料的前提下，本平台有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
                </p>
                <div class="terms-section">六、版权声明</div>
                <p>
                    6.1 用户发表并将其上传到本网站的任何内容，本平台在全世界范围内不限形式和载体地享有永久的、不可撤销的、免费的、非独家的使用权和转授权的权利，包括但不限于修改、复制、发行、展览、改编、汇编、出版、翻译、信息网络传播、广播、表演和再创作及著作权法等法律法规确定的其他权利。
                </p>
                <p>
                    6.2 本平台特有的标识、版面设计、编排方式等版权均属本平台享有，未经本平台许可，不得任意复制或转载。
                </p>
                <p>
                    6.3 用户从本平台的服务中获得的信息，未经本平台许可，不得任意复制或转载。
                </p>
                <div class="terms-section">七、责任声明</div>
                <p>
                    7.1 用户明确同意其使用本平台网络服务所存在的风险及一切后果将完全由用户本人承担，本平台对此不承担任何责任。
                </p>
                <p>
                    7.2 本平台无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性。
                </p>
                <p>
                    7.3 本平台不保证为方便用户而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由本平台实际控制的任何网页上的内容，本平台不承担任何责任。
                </p>
                <p>
                    7.4 对于因不可抗力或本平台不能控制的原因造成的网络服务中断或其它缺陷，本平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。
                </p>
                <p>
                    7.5 对于本平台向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，本平台无需承担任何责任：
                </p>
                <p>
                    (1)本平台向用户免费提供的各项网络服务；
                </p>
                <p>
                    (2)本平台向用户赠送的任何产品或者服务；
                </p>
                <p>
                    (3)本平台向收费网络服务用户附赠的各种产品或者服务。
                </p>
                <p>
                    7.6 本平台有权于任何时间暂时或永久修改或终止本服务(或其任何部分)，而无论其通知与否，本平台对用户和任何第三人均无需承担任何责任。
                </p>
                <div class="terms-section">八、附则</div>
                <p>
                    8.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
                </p>
                <p>
                    8.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
                </p>
                <p>
                    8.3 本协议解释权及修订权归爱测试所有。
                </p>
                <div class="terms-section">如有任何关于本协议之疑惑，您可以通过如下联系方式同爱测试联系：</div>
                <div style="margin-top: 10px;">liukunlun@outlook.com</div>
                <div style="margin-top: 10px;">2019年3月10日</div>
            </div>
        </div>
    </transition>
</template>

<script>
    import Back from '../common/Back';
    import { mapActions, mapGetters } from 'vuex';

    export default {
        name: "Terms",
        components: {
            Back
        },
        computed: {
            ...mapGetters(['isLoggedIn', 'getUuid', 'getToken'])
        },
        data() {
            return {
                terms: {
                }
            }
        }
    }
</script>

<style scoped lang="scss">
    @import "../../scss/constants";

    .terms-container {
        position: fixed;
        width:100%;
        height:100%;
        top: 0;
        left: 0;
        right: 0;
        bottom: 0;
        z-index: 89;
        background-color: $bg-theme-color;
        overflow-y: auto;
    }
    .terms {
        padding: 80px 20px;
    }
    .terms-title {
        font-size: $ft-page-title;
        margin-bottom: 30px;
    }
    .terms-section {
        margin-top: 30px;
        font-size: $ft-form-normal;
    }
    .slide-enter-active,.slide-leave-active{
        transition: all 0.3s;
    }
    .slide-enter,.slide-leave-to{
        transform: translate3d(100%, 0, 0);
    }
</style>